{
    "NavItems": {
        "Home": "หน้าแรก",
        "About": "เกี่ยวกับผม",
        "Projects": "โปรเจ็ค",
        "Experiences": "ประสบการณ์",
        "Contact": "ติดต่อ"
    },
    "Home": {
        "topTitle": "เวทมนตร์เว็บไดนามิกกับ Next.js",
        "primaryWords": "นำวิสัยทัศน์สู่ความเป็นจริงด้วย",
        "SmoothUserExperiences": "ประสบการณ์ผู้ใช้ที่ไม่สะดุด",
        "SeamlessInteractions": "การโต้ตอบที่ราบรื่น",
        "IntuitiveInterfaces": "การแสดงผลที่เข้าใจง่าย",
        "FluidDesigns": "การออกแบบที่ลื่นไหล",
        "GreetingFromMe": "สวัสดี, ผมคือ อับดุลกอเดร์  Full-stack developer",
        "ShowMyWork": "ดูผลงานของผม"
    },
    "DarkModeSwitch": {
        "PowerOfDarkMode": "ปลดปล่อยพลังแห่งความมืด!",
        "LightMode": "โหมดสว่าง",
        "DarkMode": "โหมดกลางคืน"
    },
    "About": {
        "About": "เกี่ยวกับ",
        "Me": "ผม",
        "GreetingWithName": "สวัสดี, ผมคือ อับดุลกอเดร์ เปาะลอ",
        "MessageAboutMe": "ผมเป็น Full-stack developer ที่หลงใหลในการพัฒนาเว็บไซต์ด้วยประสบการณ์กว่า 5 ปี เชี่ยวชาญในการพัฒนาและสร้างแอปพลิเคชันที่ทันสมัยและใช้งานง่าย ด้วยทักษะใน React.js, Next.js, JavaScript, TypeScript, CSS, Material UI และ Tailwind CSS ผมยังมีประสบการณ์ในด้านแบ็คเอนด์ด้วย Node.js และ PHP Laravel ผมมุ่งมั่นที่จะเรียนรู้และปรับตัวเข้ากับเทคโนโลยีใหม่ๆ เพื่อนำทักษะของผมมาใช้ในโปรเจ็คที่มีพลังและมอบโซลูชันคุณภาพสูงที่เกินความคาดหมายของลูกค้า",
        "CollegiateEducation": "การศึกษาในระดับปริญญาตรี",
        "University": "มหาวิทยาลัยสงขลานครินทร์, ประเทศไทย",
        "Degree": "ปริญญาตรีบริหารธุรกิจ สาขาการจัดการสารสนเทศและคอมพิวเตอร์",
        "GPA": "เกรดเฉลี่ย : 3.32/4.00 (เกียรตินิยมอันดับสอง)",
        "UniversityPeriod": "ส.ค. 2558 - พ.ค. 2562",
        "ReachOutDirectly": "ติดต่อผมโดยตรงได้ที่อีเมล",
        "CopyEmail": "คัดลอกอีเมลของผม",
        "EmailCopied": "คัดลอกอีเมลแล้ว"
    },
    "TechStacks": {
        "Skills": "ทักษะ"
    },
    "Projects": {
        "ASomeSelectionOf": "บางส่วนของ",
        "RecentProjects": "โปรเจ็คล่าสุด",
        "OnlineSurveyPlatform-Title": "แพลตฟอร์มแบบสำรวจออนไลน์",
        "OnlineSurveyPlatform-Desc": "นำทีมพัฒนาแพลตฟอร์มแบบสำรวจออนไลน์ที่ครอบคลุม ด้วยประเภทคำถามที่หลากหลาย การตั้งค่าการไหลของแบบสำรวจที่เป็นไดนามิก และการแสดงผลลัพธ์ในรูปแบบที่เป็นภาพ เพิ่มประสบการณ์ผู้ใช้และการวิเคราะห์ข้อมูลเพื่อการตัดสินใจที่ดีขึ้น",
        "SurveyBackOfficeMonitoringSystem-Title": "ระบบตรวจสอบหลังบ้านสำหรับแบบสำรวจ",
        "SurveyBackOfficeMonitoringSystem-Desc": "พัฒนาระบบตรวจสอบหลังบ้านที่ครอบคลุมสำหรับการทำแบบสำรวจ ครอบคลุมการติดตามกิจกรรมผู้ใช้ การจัดการคำสั่งซื้อแพ็คเกจ และสถิติแบบสำรวจ เพื่อการดูแลระบบที่ดีขึ้นและการจัดการแพลตฟอร์มที่มีประสิทธิภาพ",
        "DevForum-Title": "ฟอรั่มนักพัฒนา",
        "DevForum-Desc": "สร้างฟอรั่มนักพัฒนาที่เน้น Q&A ช่วยให้ผู้ใช้สามารถถามคำถาม แบ่งปันความรู้ และแก้ปัญหาร่วมกันในชุมชนเทคโนโลยี",
        "OrderFoodOnlineApplication-Title": "แอปพลิเคชันสั่งอาหารออนไลน์",
        "OrderFoodOnlineApplication-Desc": "พัฒนาแอปพลิเคชันมือถือสำหรับการสั่งอาหารออนไลน์ด้วย Flutter ช่วยให้ผู้ใช้สามารถสั่งอาหารได้สะดวกจากที่ใดก็ได้ด้วยอินเตอร์เฟซที่ลื่นไหลและใช้งานง่าย",
        "Checkout": "ดูรายละเอียด"
    },
    "Experiences": {
        "My": "ประสบการณ์",
        "WorkExperiences": "การทำงานของผม",
        "EBM-FullStackDeveloper-Title": " Full-stack developer ",
        "EBM-FullStackDeveloper-Place": "บริษัท Excellent Business Management จำกัด, กรุงเทพมหานคร",
        "EBM-FullStackDeveloper-Period": "ต.ค. 2562 - เม.ย. 2567",
        "EBM-FullStackDeveloper-1-Desc": "ในฐานะ Full-stack developer ผมมีความเชี่ยวชาญทั้งเทคโนโลยีส่วนหน้าและส่วนหลัง รวมถึง React.js, Next.js, Redux, Material-UI, HTML, CSS, JavaScript, TypeScript, Laravel, Node.js และ MongoDB ผมออกแบบและพัฒนาโซลูชันซอฟต์แวร์ ปรับปรุงประสิทธิภาพโค้ด และจัดการเซิร์ฟเวอร์ ฐานข้อมูล และ API โดยเน้นการสร้างแอปพลิเคชันที่ตอบสนองได้ดีและมีประสิทธิภาพสูงพร้อมทั้งรักษาความปลอดภัยและการปรับขนาดได้",
        "EBM-FullStackDeveloper-2-Desc": "ในบทบาทล่าสุดของผม ผมได้เป็นผู้นำการพัฒนา enablesurvey.com แพลตฟอร์มแบบสำรวจออนไลน์ที่มีมากกว่า 20 ประเภทคำถาม การตั้งค่าการไหลของแบบสำรวจที่เป็นไดนามิก และการแสดงผลลัพธ์ในรูปแบบที่เป็นภาพ ซึ่งเพิ่มประสบการณ์ผู้ใช้และการวิเคราะห์ข้อมูล นอกจากนี้ผมยังพัฒนาระบบตรวจสอบหลังบ้านที่ครอบคลุมสำหรับการจัดการแบบสำรวจ การติดตามกิจกรรมผู้ใช้ การจัดการคำสั่งซื้อ และการตรวจสอบสถิติ นอกจากนี้ยังสร้างแอปสั่งอาหารมือถือด้วย Flutter ซึ่งให้ประสบการณ์การสั่งซื้อที่ราบรื่นและใช้งานง่ายแก่ผู้ใช้",
        "MDS-Programmer-Title": "โปรแกรมเมอร์ (สหกิจศึกษา)",
        "MDS-Programmer-Place": "บริษัท เอ็ม.ดี.ซอฟต์ จำกัด, กรุงเทพมหานคร",
        "MDS-Programmer-Period": "ม.ค. 2562 - เม.ย. 2562",
        "MDS-Programmer-1-Desc": "ในฐานะผู้ช่วยโปรแกรมเมอร์ ผมให้การสนับสนุนที่มีค่าในโปรเจ็คพัฒนาซอฟต์แวร์ ทำงานใกล้ชิดกับโปรแกรมเมอร์เพื่อดำเนินการแก้ปัญหาให้บรรลุเป้าหมายโปรเจ็ค ผมมีบทบาทสำคัญในการออกแบบและพัฒนาเว็บเพจที่น่าสนใจด้วย HTML, CSS, JavaScript และเครื่องมือเฉพาะของบริษัท เพื่อให้เป็นไปตามแนวปฏิบัติที่ดีที่สุดในเว็บพัฒนาเน้นที่ประสบการณ์ผู้ใช้และการทำงานเพื่อให้สอดคล้องกับความต้องการของโปรเจ็คและเพิ่มการใช้งานโดยรวม",
        "YICMG-Title": "ประสบการณ์ที่ YICMG",
        "YICMG-Place": "เซี่ยงไฮ้, ประเทศจีน",
        "YICMG-Period": "กรกฎาคม 2561,  กรกฎาคม 2562",
        "YICMG-1-Desc": "เข้าร่วมการแข่งขันนวัตกรรมเยาวชนด้านการบริหารจัดการและการพัฒนาภูมิภาคลุ่มแม่น้ำล้านช้าง-แม่โขง (YICMG) และได้รับรางวัลที่หนึ่งสำหรับโปรเจ็คแอปพลิเคชันไกด์นำเที่ยวของผม แอปนี้ช่วยให้นักท่องเที่ยวโดยให้ข้อมูลเกี่ยวกับสถานที่ท่องเที่ยว ข้อเสนอแนะเกี่ยวกับกิจกรรม และคำแนะนำสำหรับจุดหมายต่อไป ประสบการณ์นี้รวมถึงการทำงานเป็นทีม การวิจัยภาคสนาม และการแนะนำในการสร้างนวัตกรรม",
        "PSU-TA-Title": "ผู้ช่วยสอนและอาจารย์",
        "PSU-TA-Place": "มหาวิทยาลัยสงขลานครินทร์, ตรัง",
        "PSU-TA-Period": "ส.ค. 2561 - ธ.ค. 2561",
        "PSU-TA-1-Desc": "ผมได้ช่วยอาจารย์ในการฝึกอบรมนักเรียนด้านการพัฒนาเว็บ การออกแบบ และเทคนิคต่างๆ รวมถึงจัดการเรียนการสอนเพื่อถ่ายทอดความรู้ในหัวข้อเหล่านี้ นอกจากนี้ผมยังตรวจสอบและให้คะแนนการทดสอบและงานของนักเรียน และดำเนินงานอื่นๆ ตามที่ได้รับมอบหมาย"
    },
    "Contact": {
        "Contact": "ติดต่อ",
        "Me": "ผม",
        "LookingForATalentedDeveloper": "กำลังมองหานักพัฒนาที่มีความสามารถใช่ไหม? ติดต่อมาและสร้างสรรค์สิ่งที่ยอดเยี่ยมกัน",
        "Name": "ชื่อ",
        "EmailAddress": "ที่อยู่อีเมล",
        "Message": "ข้อความ",
        "EnterMessage": "กรอกข้อความของคุณ",
        "SendingMessage": "กำลังส่งข้อความ...",
        "SendMessage": "ส่งข้อความ  →",
        "OrReachOutDirectly": "หรือติดต่อผมโดยตรงที่อีเมล",
        "SendSuccess": "ขอบคุณครับ! ข้อความของคุณถูกส่งเรียบร้อยแล้ว แล้วผมจะติดต่อกลับหาคุณเร็วๆนี้!",
        "SendError": "ขออภัยครับ เกิดข้อผิดพลาดขณะส่งข้อความของคุณ กรุณาติดต่อผมโดยตรงที่ abdkode.p@gmail.com"
    },
    "Footer": {
        "Heading1": "ต้องการยกระดับ",
        "Heading2": "สถานะทางดิจิทัลของบริษัทคุณหรือไม่??",
        "ContactMeMessage": "ติดต่อผมวันนี้เพื่อสำรวจว่าผมจะช่วยคุณบรรลุเป้าหมายและสร้างผลกระทบได้อย่างไร",
        "LetsGetInTouch": "ติดต่อผม",
        "Copyright": "ลิขสิทธิ์ ©",
        "CopyrightName": "อับดุลกอเดร์ เปาะลอ"
    }
}